[
  {
    "Job ID": 423999,
    "Agency": "DEPARTMENT OF BUSINESS SERV.",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": ".NET DEVELOPER",
    "Civil Service Title": "CERT IT DEVELOPER (APP)",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 92194,
    "Salary Range To": 110000,
    "Work Location": "110 William St. N Y",
    "Division/Work Unit": "Technology",
    "Job Description": "SBS is seeking a .Net Developer with some CRM Dynamics experience for their Technology Unit. The Technology Unit develops, supports, and maintains the tools that SBS uses to provide its services. The .Net Developer will be responsible for developing custom .Net applications and enhancing a Microsoft Dynamics 365 system for the agency. This hands-on position will be challenged to design and develop features to new or existing .NET applications and develop innovative cost-saving Microsoft Dynamics CRM solutions that improve end-user productivity and increase overall efficiencies. You will work closely with the senior architects and be an integral part of the entire product cycle.     Responsibilities will include:   ¿Modify and develop .Net MVC code for various .Net applications to meet the business needs of the Agency, understanding and implementing business workflows and processes.  ¿Work with a Database Administrator to determine where and how to make additions and/or changes to existing database structures.  ¿Collaborate with other software developers, business analysts, and IT professionals to implement practical solutions using .Net MVC and Microsoft Dynamics.   ¿Create estimates on time and effort required to complete assignments based on business requirements  ¿Design and develop .Net and Microsoft Dynamics solutions that integrate with back-end systems (SQL, Oracle, text files, etc.,) and applications.  ¿Design and develop new solutions utilizing Web Services between both internal City systems and external Third-party systems.  ¿Participate fully and actively in deployments, provisioning activities, and other various parts of software development life cycle.",
    "Posting Date": "2019-12-11T00:00:00.000"
  },
  {
    "Job ID": 329763,
    "Agency": "NYC EMPLOYEES RETIREMENT SYS",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "ADMINISTRATIVE PROCUREMENT ANALYST",
    "Civil Service Title": "ADMINISTRATIVE PROCUREMENT ANA",
    "Job Category": "Administration & Human Resources",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 100000,
    "Salary Range To": 125000,
    "Work Location": "335 Adams Street, Brooklyn Ny",
    "Division/Work Unit": "Executive Management",
    "Job Description": "The New York City Employees’ Retirement System seeks a Deputy Director of Administration. Under the direction of the Director of Administration, the Deputy Director is responsible for establishing and maintaining processes and procedures pertaining to expenditures for major projects, including costs associated with ramp-up, execution and ramp-down.  The Deputy Director of Administration ensures compliance with NYC procurement rules and accounting principles.  In collaboration with executive leadership, they will develop and manage execution of procurement plans, including executing competitive bids, RFPs and other competitive solicitations required to complete the acquisition of goods and services.  They will also coordinate technology purchases, maintenance and support agreements and the reconciliation of invoices.  They will verify that activities are completed in compliance with contractual obligations and schedules.  They will negotiate contractual changes with vendors in accordance with established guidelines.  They will assist in preparing the annual budget request, justifications, budget variance reports, and monitoring and reporting actual expenditures and encumbrances against budget forecasts.  This position requires strong analytical and technical abilities, a high level of expertise, and big picture strategic, decision making.  The Deputy Director will function in a fast-paced environment, overseeing multiple projects simultaneously.",
    "Posting Date": "2018-02-21T00:00:00.000"
  },
  {
    "Job ID": 425076,
    "Agency": "DISTRICT ATTORNEY RICHMOND COU",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Administrative Supervisor",
    "Civil Service Title": "COMMUNITY COORDINATOR",
    "Job Category": "Administration & Human Resources",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 70000,
    "Salary Range To": 77000,
    "Work Location": "130 Stuyvesant Place, S.I.",
    "Division/Work Unit": "Human Capital",
    "Job Description": "RICHMOND COUNTY DISTRICT ATTORNEY  The men and women of the Richmond County District Attorney’s office work each day in partnership with Law Enforcement and the people of Staten Island to pursue justice for victims of crime, to prevent crime in all its forms, and to promote the safety and well-being of all citizens of our Borough.  THE BUREAU Human Capital serves as a strategic partner to the Richmond County District Attorney's Office through core HR, talent/workforce management and employee engagement. We cultivate an organizational environment that promotes change and business improvement.  THE ROLE Under the direct supervision of the Director of Operations, the candidate will be responsible for but are not limited to, the following: \tProvide coverage/back-up for court parts.  •\tOversee the day to day functions of recruitment and employee information, i.e. postings, preprocessing, onboarding, documentation, managing employee files/electronic profiles •\tSupervise timekeeper; reviewing all submitted timekeeping reports and flagging issues for further discussion •\tManage data spreadsheets that are developed for tracking •\tProcessing the bi-weekly payroll and distributing paychecks and pay stubs to employees. •\tReviewing and reconciling details from the 160/161 reports before the close of paycalc. •\tProcess stop-payments, EFT reversals, supplemental payroll and one-time payments. •\tGenerate payroll reports for oversight agency’s approval   \t •\tConduct monthly and annual reviews of agency credit card and checking account expenses.  \t •\tResearching and processing longevity differentials, service increments, and recurring increments payments; managerial/contractual salary changes based on collective bargaining/mayoral agreements; managerial lump sums and taxable fringe calculations, etc. •\tHR data entry of personnel transactions utilizing City systems •\tSupport all onboarding functions including document preparation, employee orientation and maintaining personnel records. •\tOther duties as assigned by Supervisor\tOther general clerical duties as assigned.",
    "Posting Date": "2019-12-06T00:00:00.000"
  },
  {
    "Job ID": 391317,
    "Agency": "LAW DEPARTMENT",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Agency Security Director",
    "Civil Service Title": "ASSOCIATE STAFF ANALYST",
    "Job Category": "Administration & Human Resources",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 94392,
    "Salary Range To": 94392,
    "Work Location": "100 Church St., N.Y.",
    "Division/Work Unit": "Admin Services",
    "Job Description": "The New York City Law Department is seeking a Agency Security Director in the Administration Division. Reporting to the Deputy Chief of Administration, the candidate will be responsible for the following:  Acts as security access officer for citywide systems, such as NYCAPS, PMS, PRISE, etc. Primary responsibility for ensuring the security of persons on agency premises, including responding to disruptions caused by the public, visitors and employees. Responsible for reviewing security video and notifying appropriate personnel of unusual or relevant security records. Responsible for managing internal agency security related investigations. Assist in the preparation of budget requests, bid solicitations and procurement for agency security programs, including security service contracts. Responsible to procedurally inform/train security staff and agency staff on how visitors to the Agency are managed (planned and unplanned).  Investigation of workplace violence and/or threats against agency and agents of Agency as well as fraud prevention measures. Responsible for ensuring the issuance of Agency ID cards, ensure system maintenance and adequate inventory maintenance. Responsible for granting finger reader access to non-agency personnel with appropriate approval. Works with FISA/CityTime to ensure that the hand reader system records time accurately including, but not limited to daylight savings time adjustment. Responsible for ensuring the functioning of Agency Hand readers and Finger readers, and coordinate maintenance and replacement of existing hardware. Makes requests to the Chief and Deputy Chief of Administration for new readers as needed.  Manages security staff, including contracted private security services, and 6th Floor security receptionists. Interface with Building Management Personnel at all office locations regarding security issues. Provides consultation and advice regarding safety and security to agency managers. Ensures that fire extinguishers are current and not expired. Works with the Facilities Unit to ensure that Building Management has elevators inspected regularly. Ensures that emergency evacuation chairs for people with disabilities or injuries are in working order and easily retrievable. Conducts separate drills to ensure appropriate staff knows how to properly use the emergency evacuation chair.  Represents the agency’s interest at meetings regarding security system implementation by building management (for example but not limited to: turnstiles, scrambler system).  Directs the formulation of agency security policies, procedures, strategies and programs.  Develops, implements and maintains disasters/emergency response plans, including the agency’s Continuity of Operations Plan (COOP), and authorizes ongoing modifications to such plans.  Responsible for schedule and coordination of the Agency Evacuation Drills and Fire Drills at all office locations.  Prepares reports of success and failures of Drills to the Chief and Deputy Chief of Administration.  Emergency evacuation and coordination with medical, fire and police responders. Create security training requirements for security personnel. Represents the Law Department at meetings regarding COOP, Coastal Storm Plan (CSP), Post-Emergency Canvassing Operations (PECO), and other security matters, which includes but is not limited to OEM, DOHMH and DCAS. Confers with other City agencies, including emergency service agencies, to coordinate security procedures, plans and activities. Coordinates security functions and efforts with the activities of other city agencies during emergency situations.  Coordinates security and law enforcement staff, including responding to civil disturbances within agency facilities. Agency administrator for Everbridge, the Law Department’s emergency notification system.",
    "Posting Date": "2019-04-24T00:00:00.000"
  },
  {
    "Job ID": 416547,
    "Agency": "DEPT OF CITYWIDE ADMIN SVCS",
    "Posting Type": "External",
    "# Of Positions": 1,
    "Business Title": "Application Developer",
    "Civil Service Title": "CERT IT DEVELOPER (APP)",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 89509,
    "Salary Range To": 125000,
    "Work Location": "1 Centre St., N.Y.",
    "Division/Work Unit": "Information Technology",
    "Job Description": "DCAS IT is looking to hire a MS Dynamics CRM Developer who will utilize his/her own knowledge and experience, along with current industry standard processes, to review, interpret business process needs and build applications to support applications, some of which are critical to services provided by the Agency. The candidate will be working on various systems within IT, in the Dynamics CRM team. The selected candidate will be required to develop and maintain computer systems designed to facilitate and streamline Agency processes  Responsibilities:  Work as a senior member of the CRM Technical team, supporting several Dynamics CRM Systems, including:    NOE (Notice of Examination) JAQ (Job Analysis Questionnaire) Wireless Inventory System EMF (Police Employee Management File) OTS (Vehicle Inventory System)  •\tDevelop custom applications using MS Dynamics CRM SDK, Plugins, Custom Workflows, .Net and SQL Server backend with a REST Framework based API, using Angular.js for the web front-end.  •\tServe as a subject-matter expert (SME) to enable software development best practices for application development lifecycle, while leveraging the SCRUM Agile method. Execute data migration and conversion, data integrity, system integrations, system performance and tuning. •\tRoutinely communicate with business stakeholders and translate requirements into System/Technical requirements for projects and enhancements, utilizing MS TFS (Team Foundation Server) to track Work Items •      Provide solution/Identify and recommend product customization's and enhancements to meet client requirements",
    "Posting Date": "2019-11-01T00:00:00.000"
  },
  {
    "Job ID": 422857,
    "Agency": "HOUSING PRESERVATION & DVLPMNT",
    "Posting Type": "External",
    "# Of Positions": 1,
    "Business Title": "Assistant Commissioner of Diversity, Equity and Inclusion/Equal Employment Opportunity",
    "Civil Service Title": "ASSISTANT COMMISSIONER (EQUAL",
    "Job Category": "Administration & Human Resources",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 127000,
    "Salary Range To": 137410,
    "Work Location": "100 Gold Street",
    "Division/Work Unit": "Commissioner",
    "Job Description": "Agency Description:  The New York City Department of Housing Preservation & Development (HPD) is the nation’s largest municipal housing preservation and development agency. Its mission is to promote quality housing and diverse, thriving neighborhoods for New Yorkers through loan and development programs for new affordable housing, preservation of the affordability of the existing housing stock, enforcement of housing quality standards, and educational programs for tenants and building owners. HPD is tasked with fulfilling the Mayor’s Housing New York: A Five-Borough Ten-Year Plan to create and preserve 200,000 affordable units for New Yorkers at the very lowest incomes to those in the middle class.  Job Description:   Your Team:  The Office of Diversity, Equity and Inclusion/Equal Employment Opportunity forwards the mission of HPD to construct and preserve affordable housing by ensuring that all internally- and externally-facing policies, programs and procedures are created and executed with an intersectional equity lens that focuses on wellness both for employees and the public we serve.  The Office also serves an important compliance role, ensuring that anti-discrimination laws are enforced.  The Office is transitioning to focus even more on equity and inclusion, paying close attention to race, gender, and disability as intersectional lenses to help uncover barriers to accessing resources and opportunities.   The Office works both internally and externally to ensure that the agency is as responsive as possible to the diverse public we serve through building partnerships with neighborhoods, communities and organizations. The Office also acts as a one-stop resource with regard to equity and as a liaison for HPD to equity initiatives throughout the city. Finally, the Office is committed to educating HPD’s workforce about equity and inclusion strategies and equal employment opportunity policies, as well as state and local anti-discrimination laws, in order to better equip our staff to work together and with the public in an unbiased and professional manner.   Your Role:  Reporting directly to the Agency Commissioner and with the widest latitude for independent judgement and action, the Assistant Commissioner will direct, operate and oversee all aspects of HPD’s Diversity, Equity, Inclusion and compliance with all federal, state, and local policies, procedures and regulations around equal employment opportunity.  The Assistant Commissioner of ODEI/EEO will:  •\tLead investigations into allegations of discrimination and/or harassment involving any protected class as defined by the City's EEO Policy and all other regulatory bodies.  Lead investigations into allegations of retaliation.  Prepare memoranda, determinations and remedial recommendations for the Agency Commissioner's review and acknowledgment.  •\tParticipate in the creation of policy pertaining to diversity, equity and inclusion efforts and translate into working programs.  As the Assistant Commissioner of ODEI/EEO, is responsible for reviewing all personnel policies, procedures and actions for compliance with federal, state and local laws.  Prepares and revises Agency statements and postings. •\tConfers with other executive officers on all issues pertaining to diversity, equity, inclusion and EEO; and works with them to resolve internal conflicts in these areas.  Acts as a resource and advisor to HPD senior staff and managers regarding employment-related matters and diversity, equity and inclusion issues regarding public access to HPD resources.  Liaises with the Office of Legal Affairs in the defense of the Agency in external employment complaints. •\tReviews all Reasonable Accommodation requests and makes appropriate recommendations.  Coordinates the implementation with Agency managers and staff. Supervises the Senior Advisor on Disability Policy and Services. •\tManages and supervises the Deputy EEO Officer, Equity Liaison and EEO support staff.  Conducts Agencywide live trainings.  Manages and/or prepares reports to the Department of Citywide Administrative Services.  Represents the Agency at Citywide EEO meetings.",
    "Posting Date": "2019-11-14T00:00:00.000"
  },
  {
    "Job ID": 417207,
    "Agency": "ADMIN TRIALS AND HEARINGS",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Assistant General Counsel",
    "Civil Service Title": "EXECUTIVE AGENCY COUNSEL",
    "Job Category": "Administration & Human Resources Constituent Services & Community Programs Legal Affairs",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 80000,
    "Salary Range To": 100000,
    "Work Location": "100 Church St., N.Y.",
    "Division/Work Unit": "Admin, GC, PI & Exec",
    "Job Description": "The City of New York’s Office of Administrative Trials and Hearings (OATH) is the nation’s largest administrative tribunal, holding approximately 400,000 trials and hearings a year. OATH is an independent, central administrative law court with two divisions: The OATH Trials Division and The OATH Hearings Division. The OATH Trials Division adjudicates a wide range of complex matters referred by City agencies. Its case load includes; employee discipline, retention of seized vehicles, license and regulatory enforcement. OATH Trials are conducted by Administrative Law Judges. OATH’s Hearings Division conducts hearings on summonses including health, safety and quality of life matters that are filed by more than 20 different City agencies.    The Office of the General Counsel (OGC) is a fast-paced office, providing legal service and guidance to agency staff and hearing and appeals personnel and performing diverse in-house counsel functions.  OGC is seeking a dynamic and thoughtful attorney able to serve in or grow into a senior position. This person will have responsibility for significant legal matters affecting the agency. He or she will play a key role in maintaining and strengthening the agency’s mission through research and writing, in-depth legal analysis, and advice. He or she will work collaboratively with other OGC attorneys, staff in other OATH divisions including the Trials and Hearings Divisions, Appeals unit, IT, and Clerk’s Office, and with NYC Law Department attorneys. This attorney will review and analyze appeals decisions; draft, review and assess agency policies and procedures; provide legal guidance to management; and perform Special Projects. Exceptional writing, research, analytical and organizational skills are required, as well as good communication skills. The ideal candidate enjoys writing and research, pays close attention to detail, and thinks strategically. She or he must exercise sound judgment and demonstrate a commitment to public service. Prior government service is not required but can be an asset. This position has potential for supervisory responsibilities.  Duties include but are not limited to: •\tProviding legal, policy and strategic guidance to the General Counsel and to executive staff; •\tWriting legal memoranda and providing legal advice on administrative law and other legal topics; •\tReviewing and analyzing OATH appeals decisions; •\tAssisting the NYC Law Department in collections and advising OATH’s Chief Clerk; •\tReviewing all foreclosure matters for collection of surplus monies and forwarding to the Department of Finance; •\tFiling proofs of claim in bankruptcy matters on behalf of the city; •\tEngaging in rulemaking, and responding to Freedom of Information Law requests;  •\tMonitoring and disseminating information to legal personnel about changes in laws;  •\tReviewing legislation and city agency rules to determine legal and operational impact on OATH;  •\tDrafting agency policies and protocols;  •\tProviding training to OATH hearing officers; and •\tPerforming Special Projects as requested by the General Counsel.",
    "Posting Date": "2019-10-30T00:00:00.000"
  },
  {
    "Job ID": 413979,
    "Agency": "DEPT OF INFO TECH & TELECOMM",
    "Posting Type": "External",
    "# Of Positions": 2,
    "Business Title": "Associate Cloud Reliability Engineer",
    "Civil Service Title": "CYBER SECURITY ANALYST",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "P",
    "Salary Range From": 76500,
    "Salary Range To": 90000,
    "Work Location": "255 Greenwich Street",
    "Division/Work Unit": "Citywide Cybersecurity",
    "Job Description": "About New York City Cyber Command Mission. NYC Cyber Command leads the City’s cyber defense efforts, working across more than 100 agencies and offices to prevent, detect, respond, and recover from cyber threats. NYC3 protects NYC infrastructure and critical systems from malicious attacks and safeguards the data, devices, and services of the City.   Culture. Foremost, we serve the people of the City of New York, so earning - and keeping - their trust is paramount. To deserve that trust, we relentlessly focus on facts, provide sound judgment, and maintain a healthy culture. We pride ourselves on having a respectful and inclusive workplace built on kindness, honest intellectual debate, and excellent work.   Job Description Under the direction of a Cyber Command manager, the Associate Cloud Reliability Engineers are responsible for making sure that security technologies are integrated, tested, operated, and configured to meet the objectives of NYC Cyber Command’s defensive efforts. This role is responsible for the operation of key strategic defensive technologies including cloud-based data and responder environments, perimeter defenses, Citywide email filtering technology, and endpoint protection.   Responsibilities include:  •\tWork closely with private sector partners and City Agencies to ensure the efficacy of NYC Cyber Command defense technologies;  •\tSeek to bring together business owners, incident responders, and other members of the Security Sciences team to creatively solve complex challenges with engineering solutions;  •\tAssist in the use of automation tools, configuration management solutions, DevOps principles, and data; •\tAvailable on-call to address pressing issues affecting a wide variety of challenges, and are calm under pressure",
    "Posting Date": "2019-11-04T00:00:00.000"
  },
  {
    "Job ID": 422805,
    "Agency": "DEPT OF INFO TECH & TELECOMM",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Associate Commissioner, IT Operations",
    "Civil Service Title": "COMPUTER SYSTEMS MANAGER",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 88936,
    "Salary Range To": 189000,
    "Work Location": "2 Metro Tech",
    "Division/Work Unit": "IT Operations Admind",
    "Job Description": "DoITT provides for the sustained, efficient and effective delivery of IT services, infrastructure and telecommunications to enhance service delivery to New York City's residents, businesses, employees and visitors. As the City's technology leader, DoITT is responsible for maintaining the foundational IT infrastructure and systems that touch every aspect of City life from public safety to human services, from education to economic development crossing the full spectrum of governmental operations.   The successful candidate will serve as an Associate Commissioner of IT Operations reporting to the IT Services Division. Responsibilities will include: Manage and oversee the planning, directing and coordinating operational activities of the Infrastructure Management Division; ensure that the City’s network systems and data center operations, including mainframe, Telephony, core applications, UNIX and Windows host servers are highly accessible and available and operate in a secure environment; direct the strategic planning, policy formulation and implementation of the City’s IT infrastructure and related network systems and data center operations; provide executive management for the development of major programs which seek to coordinate the effective use of technology; promote multi-jurisdictional cooperative efforts as well as citywide cost-effective IT strategies; administer the activities of the division as well as instituting policies concerning services, methods, standards, and scope for providing data communications and information systems services; represent the agency at high level meetings with citywide partners and other entities; ensure that DoITT’s technology products and services meet business requirements; and lead high priority special projects and technology initiatives.",
    "Posting Date": "2019-11-14T00:00:00.000"
  },
  {
    "Job ID": 403923,
    "Agency": "ADMIN FOR CHILDREN'S SVCS",
    "Posting Type": "External",
    "# Of Positions": 1,
    "Business Title": "Business Analyst",
    "Civil Service Title": "COMPUTER SPECIALIST (SOFTWARE)",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 89509,
    "Salary Range To": 102935,
    "Work Location": "150 William Street, New York N",
    "Division/Work Unit": "Mis Admin,Network Sysms Dvlpmt",
    "Job Description": "Please Note:  In order to be considered for this position, it is important that you permanent not provisional in the Civil Service title of Computer Specialist, Software title mentioned above.  The candidate will provide the following critical functions:   • Serve as Business Analyst for different initiatives for all ACS divisions’ projects. • Perform research, analysis, and development of project plans, work flows, business rules, and policies to enhance internal operations and computer systems.  • Conduct requirements gathering sessions with key stakeholders.  • Work with Client Relationship Managers, Project Managers and other team members, and stakeholders to achieve desired results. • Prepare high-level design documentation, business requirements documentation and functional requirements documentation. • Analyze and document requirements functional and non – functional requirements, screen mock ups and screen flows. • Analyze and document requirements for reporting needs.  • Facilitate compliance with State and agency policies by developing system requirements documents and technical specifications for computer applications that will support those policies.   MANDATORY SKILLS/EXPERIENCE Note: candidates who do not have the mandatory skills below will not be considered.   • Must have 5 years of experience in business requirement gathering, project management, testing, and creating workflows for systems.  • Must have at least 1 year of demonstrated practice using BPMN.  • Must have at least 4 years of demonstrated practice using MS Visio for flowcharting. • Demonstrated experience in analyzing, disseminating and interpreting Financial Services policies and procedures.  • Must have a minimum of 4 years of research and business analysis for client services and system enhancement.  • At least 4 years’ experience in writing user documentation, testing scripts, training materials and manuals, and user guides.  • Must have at least 3 years of demonstrated practice using MS Project  • Strong experience in system planning, testing, piloting and system implementation  • Demonstrated experience in Application, User Interface analysis and testing; understanding of System Development Life Cycle (SDLC) methodologies.",
    "Posting Date": "2019-09-03T00:00:00.000"
  },
  {
    "Job ID": 423183,
    "Agency": "POLICE DEPARTMENT",
    "Posting Type": "Internal",
    "# Of Positions": 5,
    "Business Title": "Computer Specialist (SW), level I",
    "Civil Service Title": "COMPUTER SPECIALIST (SOFTWARE)",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 81951,
    "Salary Range To": 102136,
    "Work Location": "1 Police Plaza, N.Y.",
    "Division/Work Unit": "INFO TECHNOLOGY SRV DIV/CIV",
    "Job Description": "The mission of the New York City Police Department is to enhance the quality of life in New York City by working in partnership with the community to enforce the law, preserve peace, protect the people, reduce fear, and maintain order. The NYPD strives to foster a safe and fair city by incorporating Neighborhood Policing into all facets of Department operations, and solve the problems that create crime and disorder through an interdependent relationship between the people and its police, and by pioneering strategic innovation.  The NYPD's Information Technology Bureau, IT Services Division (ITSD) supports the department by acquiring, distributing, installing and maintaining Local Area Networks, personal computers, mainframe computers, software and data communications networks, ITSD also plans and coordinates the implementation of advanced technology. ITSD is seeking candidates to work in the title of Computer Specialist Software - Level 1.to work on tasks related to Criminal Justice Reform.  The selected candidate will be a highly technical application developer for .Net development, with a broad scope of independent initiative and judgement, responsible for the design, implementation and maintenance of internal custom software solutions that supports the business. This will include design, development, configuration, maintenance and support. Development should have experience with: Microsoft Dynamics (on premise) 9.0, SharePoint 2016 and higher, ADX Studios, C#, JSON, SOAP AJAX, REST, and HTML5 as well as relational database experience with MS SQL including but not limited to stored procedure development and in-depth knowledge of SSRS.",
    "Posting Date": "2019-11-18T00:00:00.000"
  },
  {
    "Job ID": 357984,
    "Agency": "BUSINESS INTEGRITY COMMISSION",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Computer Systems Manager",
    "Civil Service Title": "COMPUTER SYSTEMS MANAGER",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 80000,
    "Salary Range To": 85000,
    "Work Location": "100 Church St., N.Y.",
    "Division/Work Unit": "Default",
    "Job Description": "The New York City Business Integrity Commission is an agency responsible for the regulation and enforcement of New York City’s trade waste industry, public markets, and shipboard gambling.  Protecting the public’s interests in these industries is core mission of BIC and it is carried out through the cooperation of various professionals within our organization.  We are currently seeking a candidate to fulfill a vacancy as a Salesforce Specialist with particular skills developing on the Salesforce platform.    The successful candidate will serve as a Salesforce Specialist reporting to the Executive Director of Information Technology.",
    "Posting Date": "2018-08-08T00:00:00.000"
  },
  {
    "Job ID": 407170,
    "Agency": "DEPT OF INFO TECH & TELECOMM",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Cyber Threat Hunter",
    "Civil Service Title": "IT SECURITY SPECIALIST",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "P",
    "Salary Range From": 75000,
    "Salary Range To": 135000,
    "Work Location": "255 Greenwich Street",
    "Division/Work Unit": "Citywide Cybersecurity",
    "Job Description": "About New York City Cyber Command Mission. NYC Cyber Command leads the City’s cyber defense efforts, working across more than 100 agencies and offices to prevent, detect, respond, and recover from cyber threats. NYC3 protects NYC infrastructure and critical systems from malicious attacks and safeguards the data, devices, and services of the City.   Culture. Foremost, we serve the people of the City of New York, so earning - and keeping - their trust is paramount. To deserve that trust, we relentlessly focus on facts, provide sound judgment, and maintain a healthy culture. We pride ourselves on having a respectful and inclusive workplace built on kindness, honest intellectual debate, and excellent work.   Job Description Threat Hunters within NYC Cyber Command (NYC3) perform many critical functions within the Threat Management discipline. Chief among these functions is proactively creating, organizing, and executing hunting hypotheses to identify previously undiscovered malicious activity within the NYC environment and data. Some of the Threat Hunters tasks are described below: -\tDirect and/or conduct hunt missions to augment detection capabilities to identify threats across NYC3 operating environment; -\tDevelop, maintain, and execute the threat hunting process and Hunt teams integration processes; -\tDevelop, maintain, and execute threat and incident communication processes that advise NYC3 network defenders and responders when an incident is identified through Hunting exercises; -\tAssist in managing and administering the toolset of the hunting team; -\tMaintain a strong working relationship with the NYC3 Cyber Threat Intelligence (CTI) team to devise hypotheses and to understand TTPs/IOCs of interest; -\tCreate use cases from hunting activity that will be utilized by the other Threat Management teams (Security Operations Center, Computer Emergency Response Team, Cyber Threat Intelligence, & Counter Threat Automation); -\tDeliver recommendations and actions to improve the detection, escalation, containment and resolution of incidents;  -\tAssist in the creation of finished reporting that will be provided to NYC3 Threat Management executives and Operational teams to outline Hunting processes, results, and capability/visibility gaps identified; -\tCreate and present custom hunt mission briefing materials for NYC3 Operational teams to provide lessons learned and hunting cross training; -\tPerform network, system, and kill chain analysis on how malicious activity was introduced and propagated within the environment; -\tSpecial projects and initiatives as assigned.",
    "Posting Date": "2019-09-30T00:00:00.000"
  },
  {
    "Job ID": 411227,
    "Agency": "DEPARTMENT OF CITY PLANNING",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Senior Programmer",
    "Civil Service Title": "TELECOMMUNICATIONS ASSOCIATE (",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 85000,
    "Salary Range To": 95000,
    "Work Location": "120 Broadway, New York, NY",
    "Division/Work Unit": "ITD- Application Development",
    "Job Description": "THE AGENCY The Department of City Planning (DCP) plans for the strategic growth and development of the City through ground-up planning with communities, the development of land use policies and zoning regulations applicable citywide and sharing its perspectives on growth and community needs with sister agencies in collaboration with the Office of Management and Budget (OMB).  DCP’s six strategic objectives include: (a) catalyze long-term neighborhood improvement through integrated planning and targeted accompanying public investments; (b) encourage housing production, affordability, and quality; (c) promote economic development and job growth; (d) enhance resiliency and sustainability of neighborhoods; (e) ensure integrity, timeliness and responsiveness in land use reviews; and, (f) supply objective data and expertise to a broad range of planning functions and stakeholders.  Central to its mission, DCP supports the City Planning Commission in its annual review of approximately 450 land use applications. The Department also works closely with OMB in developing the Ten-Year Capital Strategy, and helping administer the Neighborhood Development Fund, geared toward ensuring that growing neighborhoods undergoing rezoning have accompanying infrastructure investments.  The New York City Department of City Planning is a great place to work – cultivating intellectual inspiration, professional development and creativity. Visit our website at www.nyc.gov/planning to access the full listing of job opportunities and to learn more about our great agency.   THE DIVISION  Information Technology Division (ITD) is responsible for supporting the agencies technology footprint including technology infrastructure across five boroughs as well as workflow applications and databases for analytics and decision making. The division comprises of 70+ inter-disciplinary staff with specialties in desktop support, server engineering, database maintenance, data processing, data visualization and mapping amongst many others. The technology ecosystem in the agency has increasing become hybrid especially with deployment options (cloud vs. on premise), multiple technology stacks (commercial vs. open source) and project management (waterfall vs. agile).    Citywide Geo Application Services is responsible for the maintenance and continued enhancement of the Geosupport System, an integrated system of software and data files that processes geographic locations in New York City. Geosupport is highly customized for New York City’s geography. Currently, Geosupport is used as a component of computer applications in more than forty New York City agencies. Geosupport can be readily incorporated into users’ IBM mainframe computer and Windows-based applications that require the processing of geographic data. Citywide Geo Application Services is staffed by a team of programmers specializing in Geographic Information Systems (GIS), mainframe and desktop systems. The team also supports the Linux, GeoX, .net and Java environments.      THE ROLE   We seek a talented senior developer committed to using technology to help improve government operations and services.     Are you willing to come and shape the future of technology at City planning? In Geosupport group we are part of DCP’s innovation architecture working on helping users access Geographic information using leading edge technologies like dotNET, Java. You will be working on short projects (our engagements usually last less than 12-16 weeks) from the heart of Manhattan in New York. Our engagements use the latest of DevOps, Agile and serverless to make sure that we deliver the value in no time. As a senior developer you will be responsible of writing the code of innovative applications in areas like dotNET, Java. Your day to day tasks will include participating in the daily scrums, sprint planning and retrospectives, code user stories for both front end and backend, unit test your code and commit it into the repository. You will also be responsible of coaching and mentoring more junior members of the team. With approximately 70 billion Geosupport calls made each year, our team drives innovation to improve the way the world works and lives.     Responsibilities include, but may not be restricted to:   • Identify, analyze and develop interfaces and integration flows using Visual Studio Application platform.   • ETL data loads and integration using Python or C#.   • Responsible for programming and integration software development using various programming languages and related tools and frameworks, reviewing code written by other programmers, requirement gathering, bug fixing, testing, documenting and implementation.   • Knowledge of Web Services Interoperability, standards and ability to suggest, criticize and formulate solutions in a multi-vendor and architecture team meetings   • Work closely with leads for understanding the functional and technical design   • Develops and configures integration as per the technical design document (TDD) to meet the defined requirements.   • Complies with and helps to enforce design and coding standards, policies and procedures.   • Ensures documentation is well maintained.   • Ensures quality of coded components by performing thorough testing.   • Works collaboratively with test teams during the Product test and UAT phases to fix assigned bugs with quality.   • Reports status, issues and risks to tech leads on a regular basis   • Improves skills in integration products by completing vendor certifications.   • Conduct code reviews and be able to mentor more junior developers.",
    "Posting Date": "2019-09-17T00:00:00.000"
  },
  {
    "Job ID": 404610,
    "Agency": "POLICE DEPARTMENT",
    "Posting Type": "External",
    "# Of Positions": 1,
    "Business Title": "Senior Project Manager",
    "Civil Service Title": "CITY RESEARCH SCIENTIST",
    "Job Category": "Technology, Data & Innovation Policy, Research & Analysis",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 82008,
    "Salary Range To": 107770,
    "Work Location": "1 Police Plaza, N.Y.",
    "Division/Work Unit": "Chief Strategic Initiatives/CV",
    "Job Description": "The mission of the New York City Police Department is to enhance the quality of life in New York City by working in partnership with the community to enforce the law, preserve peace, protect the people, reduce fear, and maintain order. The NYPD strives to foster a safe and fair city by incorporating Neighborhood Policing into all facets of Department operations, and solve the problems that create crime and disorder through an interdependent relationship between the people and its police, and by pioneering strategic innovation.  The candidate selected will play an integral role in supporting the implementation of the Department’s Health and Wellness Strategic Plan.   Additionally, the Senior Project Manager will research and make recommendations on a number of initiatives to promote health and wellness techniques by working internally and externally with stakeholders.",
    "Posting Date": "2019-11-29T00:00:00.000"
  },
  {
    "Job ID": 416502,
    "Agency": "FIRE DEPARTMENT",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Senior SQL /Oracle Database Administrator",
    "Civil Service Title": "COMPUTER SPECIALIST (SOFTWARE)",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 96020,
    "Salary Range To": 120000,
    "Work Location": "9 Metrotech Center, Brooklyn N",
    "Division/Work Unit": "Bureau of Tech Deve and Syst",
    "Job Description": "The Fire Department, City of New York (FDNY), seeks a full-time Computer Specialist (Software) in the Bureau of Technology Development and Systems.  Reporting directly to the Database and Middletier Manager, the successful candidate will be responsible for capacity planning in the (development, test, staging & production) environments in support of a number of critical applications for both SQL and Oracle databases; the platform workload is approximately 30/70 percentage split respectively. The successful candidate will need to ensure database availability, data integrity for multiple database instances across both platforms. Enforce security by implementing roles and privileges.  Install, configure and upgrade both SQL and Oracle products, including but not limited to Oracle Enterprise Manager, RAC, BigData Appliance with the management of structural/unstructured data, Exadata, ASM Storage, Oracle Data Integration, Data Guard, Golden Gate and SSIS. The selected candidate will be part of a core team that will serve as an escalation point for complex Database technical challenges. Create and troubleshoot SSIS packages Create all database objects, including constraints and defined relations between tables. Create stored procedures and triggers, public synonyms, sequences and database links. Support third party software and ensure their availability Responsible of the development of Enterprise Database Model and creating database standards. Provide DBA project lead in the areas of design, develop, and infrastructure deployment. Support day to day operations of existing databases in collaboration with the Application teams. Review and coordinate systems backup and recovery operation for both SQL and Oracle databases. Participate in the management of all In-house Oracle licensing, maintenance and procurement activities. Assist the application team in troubleshooting performance related issues.  May be required to work shifts including nights, Saturdays, Sundays, and holidays.",
    "Posting Date": "2019-11-22T00:00:00.000"
  },
  {
    "Job ID": 398401,
    "Agency": "OFFICE OF THE COMPTROLLER",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Senior Systems Administrator",
    "Civil Service Title": "COMPUTER OPERATIONS MANAGER (S",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 80000,
    "Salary Range To": 90000,
    "Work Location": "1 Centre St., N.Y.",
    "Division/Work Unit": "Information Systems",
    "Job Description": "The Bureau of Information Systems & Technology (BIST) provides customer support and technology leadership for the Office of the Comptroller.  BIST provides a full range of support for key business functions and charter-mandated responsibilities of the Comptroller’s Office, including: technology strategic planning, web site development and administration, disaster recovery and business continuity services, systems development, communications and network administration, business process re-engineering, change and program management, security administration, help desk, training, applications architecture, computer operations, telecommunications, document management, geographic information systems, webcasting and video services, graphics design, and social media support.  Under the direction of the Director-Operations & Network Services, and afforded very wide latitude for independent judgment and decision making, the Senior Systems Administrator responsibilities include, but are not limited to the following:  • Participate on the Windows Active Directory Domain Administrator Support Team in providing timely and efficient support to assigned operations; coordinate day-to-day operations, apply    security patches/fixes and anti-virus updates as released by software manufacturers and anti-virus vendors, create and implement domain level security policies such as authentication          mechanisms, password policies and rules, IPSEC policies etc.   • Design, architect and implement Active Directory Infrastructure, including, design and implementation of Group Policy; plan and design Group Policy Objects as requested to ensure compliance    with office policies for servers and user end-point devices; troubleshoot and resolve issues associated with Active Directory, GPO, Active Directory Federated Services, and password/identity    management systems;  • Assist in the management and support of internal and external DNS systems and internal DHCP architecture and scoping; follow and apply configuration and security standards and policies    within a defined Change Management process; assist with implementing solutions for hardware and software; implement common preventive maintenance practices for hardware and software;  • Ensure that system improvements and changes are implemented correctly and completely, and monitor all effects of the modifications; collaborate in assessing current and expected Windows    infrastructure needs, configuration, maintenance, optimization and documentation of Windows infrastructure;  • Ensure system backups run successfully and that all new servers and applications are added to the backup; provide first and second level support for remote access connectivity via our Citrix    environment; primarily responsible for provisioning new applications and users and troubleshooting issues with the same procedures;   • Understand, document and diagnose infrastructure issues especially VLAN, Name Resolution and bandwidth related items; perform and analyze packet captures to resolve connectivity and     reliability concerns;   • Integrate new hardware and applications related to network and systems infrastructure; assess and optimize our VMware hosts and virtual servers, through network monitoring, statistics,    provisioning, decommissioning and daily health checks; and,  • Perform other related assignments and duties, as may be required.",
    "Posting Date": "2019-08-08T00:00:00.000"
  },
  {
    "Job ID": 421502,
    "Agency": "OFFICE OF MANAGEMENT & BUDGET",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Unit Head  Reporting and Applications Development",
    "Civil Service Title": "BUDGET ANALYST (OMB)",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 98388,
    "Salary Range To": 98388,
    "Work Location": "255 Greenwich Street",
    "Division/Work Unit": "Capital and MGMT Systems",
    "Job Description": "TASK FORCE: \t\tINFORMATION SYSTEMS  UNIT:\t\tReporting and Applications Development   JOB TITLE: \t\t\tOne (1) Unit Head  CONTROL CODE: \tOTH-19-02   SUMMARY:  The Mayor’s Office of Management and Budget (OMB) is the City government's chief financial agency. OMB's staff of analysts and experts assembles and oversees the Mayor’s expense and capital budgets, which fund the services and activities of approximately 70 City agencies.   Within OMB, the Information Systems Task Force supports the agency’s staff by providing the hardware and software necessary for budget preparation and analysis. The Task Force’s Reporting and Applications Development Unit provides support for financial reporting and analysis, application development and support that is not part of a broader citywide initiative, publication support during the financial plan process, and technical support to the OMB user community.   JOB DESCRIPTION:  The duties of this position encompass the following activities:  •\tLead the Reporting and Applications Development Unit managing multiple projects simultaneously. •\tSupport the creation and maintenance of report publications issued during the financial plan process. •\tDesign, create and administer internal and external OMB applications not part of a bigger citywide initiative. •\tWork with OMB staff and executive management to define the correct platform and tools to meet specific OMB business needs.  •\tAct as a technical resource to OMB’s management and user community.",
    "Posting Date": "2019-11-04T00:00:00.000"
  },
  {
    "Job ID": 422218,
    "Agency": "FIRE DEPARTMENT",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Vmware VDI Architect",
    "Civil Service Title": "COMPUTER SPECIALIST (SOFTWARE)",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 98901,
    "Salary Range To": 136951,
    "Work Location": "9 Metrotech Center, Brooklyn N",
    "Division/Work Unit": "Bureau of Tech Deve and Syst",
    "Job Description": "The Fire Department, City of New York (FDNY), seeks a full-time Computer Specialist (Software) in the Bureau of Technology Development and Systems. Reporting directly to the Server and Systems Management Manager, the successful candidate will be serve as a Vmware VDI Architect responsible for implementing, troubleshooting, deploying and administering the new Vmware VDI infrastructure.  Responsible for implementing disaster recovery failover procedures related to VDI and user access in emergency situations.  Special Working Conditions: May be required to work shifts including nights, Saturdays, Sundays, and holidays.",
    "Posting Date": "2019-11-30T00:00:00.000"
  },
  {
    "Job ID": 424469,
    "Agency": "DEPARTMENT OF CORRECTION",
    "Posting Type": "External",
    "# Of Positions": 1,
    "Business Title": "Voice Communication Specialist",
    "Civil Service Title": "CERTIFIED IT ADMINISTRATOR (LA",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 81951,
    "Salary Range To": 94244,
    "Work Location": "75-20 Astoria Blvd",
    "Division/Work Unit": "Information Systems-Admin",
    "Job Description": "The New York City Department of Correction (DOC) is an integral part of the City’s evolving criminal justice system, participating in reform initiatives and strategies aimed to move the City towards the smallest jail system possible without compromising public safety. The DOC is solely responsible for maintaining a safe and secure environment for staff, visitors, volunteer and people in custody inside our jails. Importantly, safe jails enable DOC to providing people in custody with the tools and opportunities they need to successfully re-enter their communities. The DOC operates facilities and court commands across the five boroughs with over 12,000 diverse professionals and knowledge experts.  The  Voice Communication Specialist,  will use knowledge of Cisco Voice and Networking Technologies to ensure the successful delivery of VOIP solutions to our Agency. The candidate  will be an integral part of our Telecommunications team, collaborating internally and externally, managing a large Cisco Voice infrastructure across various facilities on Rikers, Headquarters and our Borough commands.  Responsibilities Include:   • Oversight of global Cisco Call Manager infrastructure;  • Managing client VOIP on-boardings; • Day to day management of VOIP infrastructure;  • Troubleshooting VOIP related support tickets.",
    "Posting Date": "2019-11-29T00:00:00.000"
  },
  {
    "Job ID": 424227,
    "Agency": "FINANCIAL INFO SVCS AGENCY",
    "Posting Type": "Internal",
    "# Of Positions": 1,
    "Business Title": "Web Application Developer",
    "Civil Service Title": "SENIOR IT ARCHITECT",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "F",
    "Salary Range From": 100000,
    "Salary Range To": 105000,
    "Work Location": "5 Manhattan West",
    "Division/Work Unit": "OPS/Technical Systems",
    "Job Description": "The Financial Information Services Agency (FISA) has a vacancy for a Web Application Developer to support the Payroll and Pension Payroll related Applications. The candidate will be responsible for new Web-based development and maintenance of applications relating to the FIM (FISA Identity Management System), PI (Payroll Information) System, EStubs(Employee Pay Stubs), LUR (Login and User Reports), PPMS(Pension Payroll Management System), WBAS(Welfare Benefits), W2AM(Agency Amendments to W2), WCFP (Worker ' s Comp Forms), and REFTAM(Reference Table Maintenance) system. In support of these applications, the tasks will include: Graphical User Interface, End to End application development and Database Design, coding, working with a source control system, unit testing, supporting system testing, security testing, development planning, and troubleshooting production problems. These tasks must take place within FISA-OPA's quality control and development standards, and software life cycle methodology context.",
    "Posting Date": "2019-11-27T00:00:00.000"
  },
  {
    "Job ID": 424356,
    "Agency": "FINANCIAL INFO SVCS AGENCY",
    "Posting Type": "External",
    "# Of Positions": 1,
    "Business Title": "Windows Technical Project Manager",
    "Civil Service Title": "IT PROJECT SPECIALIST",
    "Job Category": "Technology, Data & Innovation",
    "Full-Time/Part-Time indicator": "",
    "Salary Range From": 120000,
    "Salary Range To": 150000,
    "Work Location": "5 Manhattan West",
    "Division/Work Unit": "OPS/SS Technical Services",
    "Job Description": "The Financial Information Services Agency (FISA) is seeking a seasoned Windows Technical Project Lead with extensive experience in the management of multiple Windows servers and other LAN equipment in a multi-tiered environment, to support New York City' s Automated Personnel System (NYCAPS), Financial Management System (FMS), Payroll Management System (PMS), Pension Payroll System (PPMS) and Timekeeping System (CityTime). With these numerous projects comes the responsibility of implementing, managing and monitoring the infrastructure that resides on them. This includes over 300 Windows 2012 servers running multiple Microsoft applications such as Exchange, SCCM , SQL, Sharepoint, Netscalaer, Airwatch.  The Windows Technical Project Lead will work with the cross system application and integration teams on tactical and strategic projects in addition to handling the agencies LAN and numerous Enterprise applications which reside on a Web platform attached to a Cisco infrastructure. Responsibilities will include managing projects and operations including issue resolution, resource utilization and task schedule management; Providing leadership to the Windows team to best meet the commitments and the project target dates; Supporting backup, recovery, performance and tuning, problem determination and resolution.",
    "Posting Date": "2019-11-27T00:00:00.000"
  }
]